<template>
  <v-container class="fill-height">
    <v-responsive class="d-flex align-center text-center fill-height">
      <v-img height="300" v-if="themeStore.theme !== 'dark'" src="@/assets/logo.png"/>
      <v-img height="300" v-else src="@/assets/logo-dark.png"/>

      <div class="py-6 text-body-1 font-weight-regular mb-n1">北京大学物理学院</div>

      <div class="py-14"/>

      <div class="text-left" style="text-indent: 2em">
        <h2 class="text-left">综合指导课手册</h2>
        <h3>前言</h3>
        <p>
          北京大学物理学院综合指导课是面向学院全体本科生的综合性指导课程。通过教师与学生的一对一谈话，帮助本科生解决大学生活各个阶段所遇到的不同问题，在现有学生工作的基础上，依靠全体教师力量，为学生健康生活和成长成才提供指导，实现全员育人、全过程育人、全方位育人。学生通过选课平台可对开课老师及谈话时间进行选择，谈话内容包括但不限于课程学习，学业规划，未来发展，人生困惑等各个方面。本课程要求物理学院本科生低年级每学期两次约谈教师，高年级可以用本研指导代替不超过
          3 次的综合指导课课程。学生四年期间至少完成 8 次选课，未完成者按照本课程必修零学分处理。</p>

        <p>希望通过综合指导课的学习交流，有效提升学生学习生活质量，引导学生更早的明确目标，规划生活，健康成长。</p>

        <h3>课程介绍</h3>
        <p>
          2003年，学院实行新的本科生教学计划，设计了适应不同学生特点的几种培养方案，给同学更大的自主选课权限;为帮助学生更好的适应新的选课、培养制度，学院组建了本科生选课指导委员会，由院内各系、所的资深教师组成，给予同学们选课、专业发展的指导及建议。此外，实行本科生的小班管理制度，聘请博士生任本科生班主任，由教师担任年级主任组织班主任共同开展学生辅导工作;经过几年的实践，取得了良好的效果。</p>
        <p>
          在此基础上，自2008年春季学期开始，学院试行“本科生综合指导课”。此计划的内容为:院内所有在职的教师，自讲师以上(包含讲师)，每学期都必须至少与6位本科生谈话，每次谈话的时间不少于半小时;院内的本科生，自2006级开始，每位同学每学期都必须预约院内的教师谈话一次，自2018年起课程要求进行了进一步的修改和完善：建议物理学院本科生低年级每学期选课2次，高年级可以用本研指导代替不超过3次的综合指导课课程。综合指导课作为物理学院本科生必修培养课程一部分，在学期间共完成8次选课，未完成总课时要求的记为综合指导课成绩不合格，不予发放毕业证及学位证。谈话、指导的内容，主要包括:</p>
        <ol>
          <li>
            了解学生选课的情况，帮助他们分析课程结构，了解学生学习困难的原因，指导他们调整选课方式，并对学生的双学位、课外科研提出建议。
          </li>
          <li>
            鼓励学有余力的学生参与实验室的工作，激发学生进一步深入学习的潜力和热情，介绍自己所在研究方向的前沿和热点问题，培养学生的科学思想和专业能力，开阔学生视野。
          </li>
          <li>指导学生妥善处理出国、就业等问题，引导学生报效国家，服务社会，帮助学生建立起社会责任感、道德感和价值观。</li>
          <li>如了解学生有明显的紧张、焦虑和其他需要关注的特殊情况，指导老师可以跟学院学生工作办公室联系，由学工办介入。
          </li>
        </ol>

        <p>
          学院学工办承担了选课指导的具体工作。学院学工办负责发放通知，联系老师和同学，维护系统信息，统计数据，整理资料，答复师生疑问；培养指导学生助理维护“综合指导课预约系统“，持续改进系统功能，建设良好的师生谈话预约平台；及时解决老师们在谈话中发现的问题。为学生提供书面的选课指导，补录系统缺失的信息。</p>

        <h3>教师名录</h3>
        <p>待补充，可前往物理学院官方主页进行查看。</p>

        <h3>选课方法及学分登记</h3>
        <p>
          进行选课的同学登录综合指导课平台进行预约，检查自己的个人信息。建议将选课地址添加到收藏夹，以便再次访问。请同学们检查自己的选课次数，合理安排本学期的指导课时间。</p>

        <p>
          可以和多于两位老师进行交谈，自行联系谈话的老师，可以让老师登录综合指导课网站进行手动补录，无需填表签字交至学工办。如果接受过选课指导委员会老师的指导，但是系统中没有记录，也可以采取同样的办法。</p>

        <p>如果谈话的老师不是本院的，需用打印选课证明补录的方式来实现。需要将纸质版的选课证明递交至学工办，同时将姓名、学号和谈话的老师等相关信息发送至学工办邮箱
          phyxgb@pku.edu.cn，邮件名称“姓名-综合指导课选课信息补录”。</p>

        <p>
          除了从网上预约，学生也可以直接联系老师进行谈话，后按照补录方式申请选课信息补录。学生在与老师约定好谈话时间后请以邮件形式发送预约选课时间及咨询问题到老师邮箱，跟老师确认选课成功，同时方便老师提前就相关问题进行准备，以提升指导效果。</p>

        <p>
          建议物理学院本科生低年级每学期选课2次，高年级可以用本研指导代替不超过3次的综合指导课课程。综合指导课作为物理学院本科生必修培养课程一部分，在学期间共完成8次选课，未完成总课时要求的记为综合指导课成绩不合格，不予发放毕业证及学位证。</p>

        <p>学生应妥善安排选课计划，选课次数情况可在系统中查询。如果无法登录或遇到其他问题可联系学工办邮箱
          phyxgb@pku.edu.cn。</p>
      </div>
    </v-responsive>
  </v-container>
</template>

<script lang="ts" setup>
import {useThemeStore} from "@/store/theme";

const themeStore = useThemeStore();
</script>
